In [1]:
import pandas as pd

In [2]:
a=pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv',sep='\t')
a.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
a.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [4]:
a.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [5]:
a.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
type(a.dtypes=='object')

pandas.core.series.Series

In [7]:
type(a.dtypes[a.dtypes=='object'].index)

pandas.core.indexes.base.Index

# @@ Extract the object type data from the whole dataset

In [8]:
b=a.dtypes[a.dtypes=='object'].index
b

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [9]:
a[b]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
151,"Pears, Mrs. Thomas (Edith Wearne)",female,113776,C2,S
152,"Meo, Mr. Alfonzo",male,A.5. 11206,NaN,S
153,"van Billiard, Mr. Austin Blyler",male,A/5. 851,NaN,S
154,"Olsen, Mr. Ole Martin",male,Fa 265302,NaN,S
155,"Williams, Mr. Charles Duane",male,PC 17597,NaN,C

In [10]:
a[b].describe()

                         Name   Sex        Ticket        Cabin Embarked
count                     156   156           156           31      155
unique                    156     2           145           28        3
top     Wheadon, Mr. Edward H  male  S.O.C. 14879  C23 C25 C27        S
freq                        1   100             2            2      110

In [11]:
c=a[b]['Cabin'].isnull()==True
a[b]['Cabin'][c]

0      NaN
2      NaN
4      NaN
5      NaN
7      NaN
      ...
150    NaN
152    NaN
153    NaN
154    NaN
155    NaN
Name: Cabin, Length: 125, dtype: object

In [12]:
a[['Name','Sex','Age']]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
151                  Pears, Mrs. Thomas (Edith Wearne)  female  22.0
152                                   Meo, Mr. Alfonzo    male  55.5
153                    van Billiard, Mr. Austin Blyler    male  40.5
154                              Olsen, Mr. Ole Martin    male   NaN
155                        Williams, Mr. Charles Duane    male  51.0

[156 rows x 3 columns]

#  @@ Extract the int64 data from the dataset

In [13]:
d=a.dtypes[a.dtypes=='int64'].index
a[d]

     PassengerId  Survived  Pclass  SibSp  Parch
0              1         0       3      1      0
1              2         1       1      1      0
2              3         1       3      0      0
3              4         1       1      1      0
4              5         0       3      0      0
..           ...       ...     ...    ...    ...
151          152         1       1      1      0
152          153         0       3      0      0
153          154         0       3      0      2
154          155         0       3      0      0
155          156         0       1      0      1

[156 rows x 5 columns]

In [14]:
a[d].describe()

       PassengerId    Survived      Pclass       SibSp       Parch
count   156.000000  156.000000  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077    0.615385    0.397436
std      45.177428    0.477275    0.795459    1.056235    0.870146
min       1.000000    0.000000    1.000000    0.000000    0.000000
25%      39.750000    0.000000    2.000000    0.000000    0.000000
50%      78.500000    0.000000    3.000000    0.000000    0.000000
75%     117.250000    1.000000    3.000000    1.000000    0.000000
max     156.000000    1.000000    3.000000    5.000000    5.000000

In [15]:
a.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [16]:
a['Survived'][56]

1

In [17]:
a['Survived'][10:20]

10    1
11    1
12    0
13    0
14    0
15    1
16    0
17    1
18    0
19    1
Name: Survived, dtype: int64

In [18]:
a['Survived'][10:21:2]

10    1
12    0
14    0
16    0
18    0
20    0
Name: Survived, dtype: int64

In [19]:
a[['Survived']][10:21:2]   # to show in dataframe

    Survived
10         1
12         0
14         0
16         0
18         0
20         0

In [20]:
a[['Survived','Pclass']][10:21:2]

    Survived  Pclass
10         1       3
12         0       3
14         0       3
16         0       3
18         0       3
20         0       2

In [21]:
# sorted order

sorted(a['Pclass'][5:20:2])

[1, 2, 2, 2, 3, 3, 3, 3]

In [22]:
sorted(a['Name'][2:30:2])

['Allen, Mr. William Henry',
 'Emir, Mr. Farred Chehab',
 'Fynney, Mr. Joseph J',
 'Heikkinen, Miss. Laina',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'McCarthy, Mr. Timothy J',
 'McGowan, Miss. Anna "Annie"',
 'O\'Dwyer, Miss. Ellen "Nellie"',
 'Palsson, Miss. Torborg Danira',
 'Rice, Master. Eugene',
 'Sandstrom, Miss. Marguerite Rut',
 'Saundercock, Mr. William Henry',
 'Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)',
 'Vestrom, Miss. Hulda Amanda Adolfina']

# @@@ task @@@

In [23]:
#  1.load a data
a=pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv',sep='\t')

#  2.describe a numerical data
b=a.describe()

#  3.store a described result in dataframe
c=pd.DataFrame(b)

#  4. select one column & filter all the data available on even index
f=a['Age'][0::2]

#  5. perform a sorting operation on selected data on qstn 4
s=sorted(a['Age'][0::2])

In [24]:
a['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64

In [25]:
b=pd.Categorical(a['Pclass'])
b   ## it shows the total num of unique data

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [26]:
c=a['Pclass'].unique()   # unique data
c

array([3, 1, 2], dtype=int64)

In [27]:
d=a['Cabin'].astype(str)   # convert to str
d
r=[cab[0] for cab in d]    # take the first letter
a['cabin_1']=r     # create new column in previous
a

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,n
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,n
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,n
...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S,C
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S,n
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S,n
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S,n
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C,n

In [28]:
import numpy as np

b=np.where(a['Age'].isnull()==True)    # find where is null value (index)
b

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [29]:
max(a['Fare'])

263.0

In [30]:
np.where(a['Fare']==max(a['Fare']))  # extract the max value's index

(array([27, 88], dtype=int64),)

In [31]:
# row selection
#  1. iloc
#  2. ix
#  3.loc

In [32]:
#   1. iloc   (row selection)

g=a.iloc[np.where(a['Fare']==max(a['Fare']))]
              # max fare with whole information

In [33]:
g[['Name','Age']]    # according to max fare

                              Name   Age
27  Fortune, Mr. Charles Alexander  19.0
88      Fortune, Miss. Mabel Helen  23.0

In [34]:
#  Name, Cabin who have min age

p=a.iloc[np.where(a['Age']==min(a['Age']))]
p[['Name','Cabin']]

                             Name Cabin
78  Caldwell, Master. Alden Gates   NaN

In [35]:
# want to concat two column & create another column

a['new1']=a['SibSp']+a['Parch']
g=a.iloc[np.where(a['new1']==max(a['new1']))]
g

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_1,new1
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,NaN,S,n,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,NaN,S,n,7

In [36]:
# convert array, dict, list into series then into dataframe :

l1=['a','b','c']
l2=[10,20,30]
a=np.array(l2)
d={'a':10,'b':20,'c':30}

print('labels :',l1)
print('my data :',l2)
print('array :',a)
print('dictionary :',d)

labels : ['a', 'b', 'c']
my data : [10, 20, 30]
array : [10 20 30]
dictionary : {'a': 10, 'b': 20, 'c': 30}

In [37]:
pd.Series(l2)   # list -> series

0    10
1    20
2    30
dtype: int64

In [38]:
p=pd.Series(l2,index=['a','b','c'])  
p
# change the index in ur own way

a    10
b    20
c    30
dtype: int64

In [39]:
p[0]

10

In [40]:
pd.Series(l2,index=l1)

a    10
b    20
c    30
dtype: int64

In [41]:
pd.Series(a)   # array -> series

0    10
1    20
2    30
dtype: int32

In [42]:
pd.Series(d)   # dict -> series

a    10
b    20
c    30
dtype: int64

In [43]:
pd.DataFrame(d,index=['e','t','u',9,5])

    a   b   c
e  10  20  30
t  10  20  30
u  10  20  30
9  10  20  30
5  10  20  30

In [44]:
print('show the inbuuilt function\n','-'*40,sep='')
pd.Series([type,sum,max])

show the inbuuilt function
----------------------------------------

0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [45]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser2

CA    1
OR    2
NV    5
AZ    4
dtype: int64

In [46]:
ser1[0:3:2]

2    1
6    3
dtype: int64

In [47]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser1:\n", ser1[0:3:2], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser1:
2    1
6    3
dtype: int64

In [48]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [49]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [55]:
################ can not complete


# parent folder
    # child1 folder
    #child2 ""
    #child3 ""
#   *** store ***
# 1. pdf -> read from pdf
# 2. word document-> read
# 3. .txt read operation

#  * parent check-> child1,2,3 check-> then check file-> extract

import pandas as pd
#import tabula 
a=pd.read_csv(r'E:\INEURON\course code\panda\examples\written\parent\child1\a_txt.txt')
#d=tabula.read_pdf(r'E:\INEURON\course code\panda\examples\written\parent\child1\foo.pdf')